\newpage

\section[Программная реализация]{\large \centering Программная реализация}
\hspace{\parindent} Разработанный алгоритм реализован на языке программирования C++ без использования сторонних библиотек и может быть запущен на всех основных операционных системах: Windows, Linux, Mac OS. Кроме основного приложения, был создан веб-интерфейс, через который также можно получить выравнивание. Так как задача требует существенных вычислительных ресурсов, практично запускать программу на мощной вычислительной платформе, а осуществлять взаимодействие с ней через веб-интерфейс. Кроме этого, для возможности внедрения отдельных компонент программы в другие проекты, были собраны статические библиотеки построения парного и множественного выравниваний.

\subsection[Структуры данных]{\large Структуры данных}
\hspace{\parindent} Ниже описанны используемые в программе структуры для хранения и обработки данных. Они также входят в состав собранных статических библиотек.

\subsubsection[Представление биологических последовательностей]{\large Представление биологических последовательностей}
\hspace{\parindent} Для представления биологических последовательностей используется структура $BioSeq$ с двумя строковыми полями:
\begin{itemize}
	\item $name$ --- идентификатор последовательности
	\item $nt\_seq$ --- последовательность нуклеотидов
\end{itemize}

Для удобства использования у нее определен оператор индексирования [ ] и функция $Length$, возвращающая текущую длину последовательности. Чтобы иметь связь нуклеотидного и аминокислотного уровней, реализованы методы, позволяющие получить как трансляцию всей строки по первой рамке считывания, так и конкретного триплета, начинающегося с $i$-го индекса. Также, необходимо иметь возможность вставлять разрывы в последовательность, для чего были добавлены методы $InsertGap(int$ $pos)$ и $InsertGap(int$ $pos,$ $int$ $count)$, добавляющие $1$ или $count$ разрывов по индексу $pos$. Печать реализована через перегруженную операцию $<<$ (листинг~\ref{lst:BioSeqPrint}),
\begin{algorithm}
	\caption{Печать структуры BioSeq через перегруженную операцию $<<$} \label{lst:BioSeqPrint}
	\begin{lstlisting}
friend std::ostream& operator << (std::ostream& stream, 
					const BioSeq& data) {
	stream << data.name << std::endl;
	stream << data.nt_seq << std::endl;
	return stream;
}
	\end{lstlisting}
\end{algorithm}

Это позволяет оформить вывод результата следующим образом: листинг~\ref{lst:BioSeqPrintExample}, однако, в качестве работы программы желательно получить выравнивание не только на нуклеотидном, но также и на аминокислотном уровне. Для наглядного разделения этих двух опций, в структуру были добавлены методы $void$ $PrintNT(std::ostream\&$ $out)$ и $void$ $PrintAA(std::ostream\&$ $out);$, которые выводят результат выравнивания и его трансляцию соответственно в указанный поток $out$.
\begin{algorithm}
	\caption{Вывод результатов выравнивания и их трансляций различными способами} \label{lst:BioSeqPrintExample}
	\begin{lstlisting}
for_each(data.begin(), data.end(), [] (BioSeq* seq) { 
		std::cout << *seq; 
		seq->PrintNT(std::cout);
		seq->PrintAA(std::cout);
	} );
	\end{lstlisting}
\end{algorithm}


\subsubsection[Класс построения парного выравнивания]{\large Класс построения парного выравнивания}
\hspace{\parindent} 

\subsubsection[Профили]{\large Профили}
\hspace{\parindent} 

\subsection[Общая схема работы]{\large Общая схема работы}
\hspace{\parindent} Все разбито на отдельные блоки-этапы, блок-схема

\subsubsection[Чтение входных данных]{\large Чтение входных данных}
\hspace{\parindent} Формат входных данных, FASTA и че еще есть
как пиздато одним шмотком память выделяется
листинг с примерами, чтение FASTA

\subsubsection[Определение порядка выравнивания]{\large Определение порядка выравнивания}
\hspace{\parindent} Экономия памяти, нет перевыделения строк

\subsubsection[Объединение профилей]{\large Объединение профилей}
\hspace{\parindent} Пиздатый плюсик

\subsection[Параметры выравнивания]{\large Параметры выравнивания}
\hspace{\parindent} графический интерфейс консолька

\subsection[Руководство пользователя]{\large Руководство пользователя}
\hspace{\parindent} параметры варавнивания графический интерфейс консолька